In [57]:
import pandas as pd

In [58]:
data=pd.Series(["mango","banana","apple","orange","sapota","sitaphal","grapes"],name="fruits")
data

0       mango
1      banana
2       apple
3      orange
4      sapota
5    sitaphal
6      grapes
Name: fruits, dtype: object

In [59]:
df2=pd.DataFrame(data)
df2

     fruits
0     mango
1    banana
2     apple
3    orange
4    sapota
5  sitaphal
6    grapes

In [60]:
# c-comma s-seprated v-value
# pd.read_excel("file name.xml")
# pd.json("file name.json")
# pd.sql("file name.sql")
df=pd.read_csv("data.csv")
df

    fruit   color  price
0   mango  orange    500
1  banana  yellow    100
2   apple     red    600
3  orange  orange    100
4  grapes   green     50
5  sapota   brown    300

In [61]:
df

    fruit   color  price
0   mango  orange    500
1  banana  yellow    100
2   apple     red    600
3  orange  orange    100
4  grapes   green     50
5  sapota   brown    300

In [62]:
df.head(4)

    fruit   color  price
0   mango  orange    500
1  banana  yellow    100
2   apple     red    600
3  orange  orange    100

In [63]:
df.tail(3)

    fruit   color  price
3  orange  orange    100
4  grapes   green     50
5  sapota   brown    300

In [64]:
df.head()

    fruit   color  price
0   mango  orange    500
1  banana  yellow    100
2   apple     red    600
3  orange  orange    100
4  grapes   green     50

In [65]:
df.tail()

    fruit   color  price
1  banana  yellow    100
2   apple     red    600
3  orange  orange    100
4  grapes   green     50
5  sapota   brown    300

In [66]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   fruit   6 non-null      object
 1   color   6 non-null      object
 2   price   6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [68]:
df

    fruit   color  price
0   mango  orange    500
1  banana  yellow    100
2   apple     red    600
3  orange  orange    100
4  grapes   green     50
5  sapota   brown    300

In [ ]:
df.describe()    # 50,100,100,300,500,600

            price
count    6.000000
mean   275.000000
std    231.840462
min     50.000000
25%    100.000000
50%    200.000000
75%    450.000000
max    600.000000